Rahix/avr-device/vendor/atmega169pa.atdf
      <value-group name="MISC_3BIT_COUNT">
        <value caption="1" name="1" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="3" name="3" value="0x02"/>
        <value caption="4" name="4" value="0x03"/>
        <value caption="5" name="5" value="0x04"/>
        <value caption="6" name="6" value="0x05"/>
        <value caption="7" name="7" value="0x06"/>
        <value caption="8" name="8" value="0x07"/>
      </value-group>
      <value-group name="LCD_DISP_CONF_DRIVE">
        <value caption="300us" name="300US" value="0x00"/>
        <value caption="70us" name="70US" value="0x01"/>
        <value caption="150us" name="150US" value="0x02"/>
        <value caption="450us" name="450US" value="0x03"/>
        <value caption="575us" name="575US" value="0x04"/>
        <value caption="850us" name="850US" value="0x05"/>
        <value caption="1150us" name="1150US" value="0x06"/>
        <value caption="50% of LCD clock" name="50_PERCENT_OF_LCD_CLOCK" value="0x07"/>
      </value-group>
      <value-group name="LCD_CONTRAST">
        <value caption="2.60V" name="2_60V" value="0x00"/>
        <value caption="2.65V" name="2_65V" value="0x01"/>
        <value caption="2.70V" name="2_70V" value="0x02"/>
        <value caption="2.75V" name="2_75V" value="0x03"/>
        <value caption="2.80V" name="2_80V" value="0x04"/>
        <value caption="2.85V" name="2_85V" value="0x05"/>
        <value caption="2.90V" name="2_90V" value="0x06"/>
        <value caption="2.95V" name="2_95V" value="0x07"/>
        <value caption="3.00V" name="3_00V" value="0x08"/>
        <value caption="3.05V" name="3_05V" value="0x09"/>
        <value caption="3.10V" name="3_10V" value="0x0A"/>
        <value caption="3.15V" name="3_15V" value="0x0B"/>
        <value caption="3.20V" name="3_20V" value="0x0C"/>
        <value caption="3.25V" name="3_25V" value="0x0D"/>
        <value caption="3.30V" name="3_30V" value="0x0E"/>
        <value caption="3.35V" name="3_35V" value="0x0F"/>
      </value-group>
    </module>
    <module caption="Universal Serial Interface" name="USI">
      <register-group caption="Universal Serial Interface" name="USI">
        <register caption="USI Data Register" name="USIDR" offset="0xBA" size="1" mask="0xFF">
          <bitfield caption="USI Data bits" mask="0xFF" name="USIDR"/>
        </register>
        <register caption="USI Status Register" name="USISR" offset="0xB9" size="1" ocd-rw="R">
          <bitfield caption="Start Condition Interrupt Flag" mask="0x80" name="USISIF"/>
          <bitfield caption="Counter Overflow Interrupt Flag" mask="0x40" name="USIOIF"/>
          <bitfield caption="Stop Condition Flag" mask="0x20" name="USIPF"/>
          <bitfield caption="Data Output Collision" mask="0x10" name="USIDC"/>
          <bitfield caption="USI Counter Value Bits" mask="0x0F" name="USICNT"/>
        </register>
        <register caption="USI Control Register" name="USICR" offset="0xB8" size="1">
          <bitfield caption="Start Condition Interrupt Enable" mask="0x80" name="USISIE"/>
          <bitfield caption="Counter Overflow Interrupt Enable" mask="0x40" name="USIOIE"/>
          <bitfield caption="USI Wire Mode Bits" mask="0x30" name="USIWM" values="COMM_USI_OP"/>
          <bitfield caption="USI Clock Source Select Bits" mask="0x0C" name="USICS"/>
          <bitfield caption="Clock Strobe" mask="0x02" name="USICLK"/>
          <bitfield caption="Toggle Clock Port Pin" mask="0x01" name="USITC"/>
        </register>
      </register-group>
      <value-group name="COMM_USI_OP">
        <value caption="Normal Operation" name="NORMAL_OPERATION" value="0x00"/>
        <value caption="Three-Wire Mode" name="THREE_WIRE_MODE" value="0x01"/>
        <value caption="Two-Wire Mode" name="TWO_WIRE_MODE" value="0x02"/>
        <value caption="Two-Wire Mode Held Low" name="TWO_WIRE_MODE_HELD_LOW" value="0x03"/>
      </value-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
          <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF3"/>
          <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"/>
        </register>
        <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x7A" size="1" ocd-rw="R">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="ADC Data Register Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF">
          <bitfield caption="ADC Data Bits" mask="0x03FF" name="ADC" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield caption="ADC Auto Trigger Sources" mask="0x07" name="ADTS"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
          <bitfield caption="ADC7 Digital input Disable" mask="0x80" name="ADC7D"/>
          <bitfield caption="ADC6 Digital input Disable" mask="0x40" name="ADC6D"/>
          <bitfield caption="ADC5 Digital input Disable" mask="0x20" name="ADC5D"/>
          <bitfield caption="ADC4 Digital input Disable" mask="0x10" name="ADC4D"/>
          <bitfield caption="ADC3 Digital input Disable" mask="0x08" name="ADC3D"/>
          <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
          <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
          <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
        </register>
      </register-group>
